//    Создать структуру для хранения Номеров паспортов и
//    Фамилий сотрудников организации.
//            123456 Иванов
//321456 Васильев
//234561 Петрова
//234432 Иванов
//654321 Петрова
//345678 Иванов
//    Вывести данные по сотрудникам с фамилией Иванов.

package HashMap;

import java.util.HashMap;
import java.util.Map;

public class Main {
    public static void main(String[] args) {
//        Map<Integer, String> map = new HashMap<>();
//        map.put(321456 , "Васильев");
//        map.put(234561 , "Петрова");
//        map.put(309856 , "Васильев");
//        map.put(235789 , "Петрова");
//        map.put(134456 , "Васильев");
//        map.put(234671 , "Петрова");
//        System.out.println(map.entrySet());
//        for (var item : map.entrySet()) {
//            if (item.getValue() == "Васильев"){
//                System.out.println (item);
//            }
//        }
    }
}
